{
    "laravel/framework": [
        {
            "cve_id": "CVE-2022-40482",
            "severity": "MEDIUM",
            "version_analyzed": "8.0",
            "affected_ranges_matched": "N/A",
            "description": "The authentication method in Laravel 8.x through 9.x before 9.32.0 was discovered to be vulnerable to user enumeration via timeless timing attacks with HTTP/2 multiplexing. This is caused by the early return inside the hasValidCredentials method in the Illuminate\\Auth\\SessionGuard class when a user is found to not exist."
        },
        {
            "cve_id": "CVE-2021-43617",
            "severity": "CRITICAL",
            "version_analyzed": "8.0",
            "affected_ranges_matched": "N/A",
            "description": "Laravel Framework through 8.70.2 does not sufficiently block the upload of executable PHP content because Illuminate/Validation/Concerns/ValidatesAttributes.php lacks a check for .phar files, which are handled as application/x-httpd-php on systems based on Debian. NOTE: this CVE Record is for Laravel Framework, and is unrelated to any reports concerning incorrectly written user applications for image upload."
        },
        {
            "cve_id": "CVE-2021-43808",
            "severity": "MEDIUM",
            "version_analyzed": "8.0",
            "affected_ranges_matched": "N/A",
            "description": "Laravel is a web application framework. Laravel prior to versions 8.75.0, 7.30.6, and 6.20.42 contain a possible cross-site scripting (XSS) vulnerability in the Blade templating engine. A broken HTML element may be clicked and the user taken to another location in their browser due to XSS. This is due to the user being able to guess the parent placeholder SHA-1 hash by trying common names of sections. If the parent template contains an exploitable HTML structure an XSS vulnerability can be exposed. This vulnerability has been patched in versions 8.75.0, 7.30.6, and 6.20.42 by determining the parent placeholder at runtime and using a random hash that is unique to each request."
        }
    ],
    "rails": [
        {
            "cve_id": "CVE-2024-26144",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "Rails is a web-application framework. Starting with version 5.2.0, there is a possible sensitive session information leak in Active Storage. By default, Active Storage sends a Set-Cookie header along with the user's session cookie when serving blobs. It also sets Cache-Control to public. Certain proxies may cache the Set-Cookie, leading to an information leak. The vulnerability is fixed in 7.0.8.1 and 6.1.7.7."
        },
        {
            "cve_id": "CVE-2024-28103",
            "severity": "CRITICAL",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "Action Pack is a framework for handling and responding to web requests. Since 6.1.0, the application configurable Permissions-Policy is only served on responses with an HTML related Content-Type. This vulnerability is fixed in  6.1.7.8, 7.0.8.2, and 7.1.3.3."
        },
        {
            "cve_id": "CVE-2023-22792",
            "severity": "HIGH",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "A regular expression based DoS vulnerability in Action Dispatch <6.0.6.1,< 6.1.7.1, and <7.0.4.1. Specially crafted cookies, in combination with a specially crafted X_FORWARDED_HOST header can cause the regular expression engine to enter a state of catastrophic backtracking. This can cause the process to use large amounts of CPU and memory, leading to a possible DoS vulnerability All users running an affected release should either upgrade or use one of the workarounds immediately."
        },
        {
            "cve_id": "CVE-2022-23633",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "Action Pack is a framework for handling and responding to web requests. Under certain circumstances response bodies will not be closed. In the event a response is *not* notified of a `close`, `ActionDispatch::Executor` will not know to reset thread local state for the next request. This can lead to data being leaked to subsequent requests.This has been fixed in Rails 7.0.2.1, 6.1.4.5, 6.0.4.5, and 5.2.6.1. Upgrading is highly recommended, but to work around this problem a middleware described in GHSA-wh98-p28r-vrc9 can be used."
        },
        {
            "cve_id": "CVE-2022-23634",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "Puma is a Ruby/Rack web server built for parallelism. Prior to `puma` version `5.6.2`, `puma` may not always call `close` on the response body. Rails, prior to version `7.0.2.2`, depended on the response body being closed in order for its `CurrentAttributes` implementation to work correctly. The combination of these two behaviors (Puma not closing the body + Rails' Executor implementation) causes information leakage. This problem is fixed in Puma versions 5.6.2 and 4.3.11. This problem is fixed in Rails versions 7.02.2, 6.1.4.6, 6.0.4.6, and 5.2.6.2. Upgrading to a patched Rails _or_ Puma version fixes the vulnerability."
        },
        {
            "cve_id": "CVE-2021-22880",
            "severity": "HIGH",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "The PostgreSQL adapter in Active Record before 6.1.2.1, 6.0.3.5, 5.2.4.5 suffers from a regular expression denial of service (REDoS) vulnerability. Carefully crafted input can cause the input validation in the `money` type of the PostgreSQL adapter in Active Record to spend too much time in a regular expression, resulting in the potential for a DoS attack. This only impacts Rails applications that are using PostgreSQL along with money type columns that take user input."
        },
        {
            "cve_id": "CVE-2021-22881",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "The Host Authorization middleware in Action Pack before 6.1.2.1, 6.0.3.5 suffers from an open redirect vulnerability. Specially crafted `Host` headers in combination with certain \"allowed host\" formats can cause the Host Authorization middleware in Action Pack to redirect users to a malicious website. Impacted applications will have allowed hosts with a leading dot. When an allowed host contains a leading dot, a specially crafted `Host` header can be used to redirect to a malicious website."
        },
        {
            "cve_id": "CVE-2021-22885",
            "severity": "HIGH",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "A possible information disclosure / unintended method execution vulnerability in Action Pack >= 2.0.0 when using the `redirect_to` or `polymorphic_url`helper with untrusted user input."
        },
        {
            "cve_id": "CVE-2021-22902",
            "severity": "HIGH",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "The actionpack ruby gem (a framework for handling and responding to web requests in Rails) before 6.0.3.7, 6.1.3.2 suffers from a possible denial of service vulnerability in the Mime type parser of Action Dispatch. Carefully crafted Accept headers can cause the mime type parser in Action Dispatch to do catastrophic backtracking in the regular expression engine."
        },
        {
            "cve_id": "CVE-2021-22903",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "The actionpack ruby gem before 6.1.3.2 suffers from a possible open redirect vulnerability. Specially crafted Host headers in combination with certain \"allowed host\" formats can cause the Host Authorization middleware in Action Pack to redirect users to a malicious website. This is similar to CVE-2021-22881. Strings in config.hosts that do not have a leading dot are converted to regular expressions without proper escaping. This causes, for example, `config.hosts << \"sub.example.com\"` to permit a request with a Host header value of `sub-example.com`."
        },
        {
            "cve_id": "CVE-2021-22904",
            "severity": "HIGH",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "The actionpack ruby gem before 6.1.3.2, 6.0.3.7, 5.2.4.6, 5.2.6 suffers from a possible denial of service vulnerability in the Token Authentication logic in Action Controller due to a too permissive regular expression. Impacted code uses `authenticate_or_request_with_http_token` or `authenticate_with_http_token` for request authentication."
        },
        {
            "cve_id": "CVE-2021-22942",
            "severity": "MEDIUM",
            "version_analyzed": "6.1.0",
            "affected_ranges_matched": "N/A",
            "description": "A possible open redirect vulnerability in the Host Authorization middleware in Action Pack >= 6.0.0 that could allow attackers to redirect users to a malicious website."
        }
    ],
    "pg": [
        {
            "cve_id": "CVE-2021-23214",
            "severity": "HIGH",
            "version_analyzed": "1.2.3",
            "affected_ranges_matched": "N/A",
            "description": "When the server is configured to use trust authentication with a clientcert requirement or to use cert authentication, a man-in-the-middle attacker can inject arbitrary SQL queries when a connection is first established, despite the use of SSL certificate verification and encryption."
        },
        {
            "cve_id": "CVE-2021-3393",
            "severity": "MEDIUM",
            "version_analyzed": "1.2.3",
            "affected_ranges_matched": "N/A",
            "description": "An information leak was discovered in postgresql in versions before 13.2, before 12.6 and before 11.11. A user having UPDATE permission but not SELECT permission to a particular column could craft queries which, under some circumstances, might disclose values from that column in error messages. An attacker could use this flaw to obtain information stored in a column they are allowed to write but not read."
        }
    ],
    "express": [
        {
            "cve_id": "CVE-2024-43796",
            "severity": "MEDIUM",
            "version_analyzed": "4.16.1",
            "affected_ranges_matched": "N/A",
            "description": "Express.js minimalist web framework for node. In express < 4.20.0, passing untrusted user input - even after sanitizing it - to response.redirect() may execute untrusted code. This issue is patched in express 4.20.0."
        },
        {
            "cve_id": "CVE-2022-24999",
            "severity": "HIGH",
            "version_analyzed": "4.16.1",
            "affected_ranges_matched": "N/A",
            "description": "qs before 6.10.3, as used in Express before 4.17.3 and other products, allows attackers to cause a Node process hang for an Express application because an __ proto__ key can be used. In many typical Express use cases, an unauthenticated remote attacker can place the attack payload in the query string of the URL that is used to visit the application, such as a[__proto__]=b&a[__proto__]&a[length]=100000000. The fix was backported to qs 6.9.7, 6.8.3, 6.7.3, 6.6.1, 6.5.3, 6.4.1, 6.3.3, and 6.2.4 (and therefore Express 4.17.3, which has \"deps: qs@6.9.7\" in its release description, is not vulnerable)."
        }
    ],
    "lodash": [
        {
            "cve_id": "CVE-2021-23337",
            "severity": "HIGH",
            "version_analyzed": "4.17.11",
            "affected_ranges_matched": "N/A",
            "description": "Lodash versions prior to 4.17.21 are vulnerable to Command Injection via the template function."
        }
    ],
    "spring-core": [
        {
            "cve_id": "CVE-2024-38820",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "The fix for CVE-2022-22968 made disallowedFields patterns in DataBinder case insensitive. However, String.toLowerCase() has some Locale dependent exceptions that could potentially result in fields not protected as expected."
        },
        {
            "cve_id": "CVE-2023-20860",
            "severity": "HIGH",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "Spring Framework running version 6.0.0 - 6.0.6 or 5.3.0 - 5.3.25 using \"**\" as a pattern in Spring Security configuration with the mvcRequestMatcher creates a mismatch in pattern matching between Spring Security and Spring MVC, and the potential for a security bypass."
        },
        {
            "cve_id": "CVE-2023-20861",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In Spring Framework versions 6.0.0 - 6.0.6, 5.3.0 - 5.3.25, 5.2.0.RELEASE - 5.2.22.RELEASE, and older unsupported versions, it is possible for a user to provide a specially crafted SpEL expression that may cause a denial-of-service (DoS) condition."
        },
        {
            "cve_id": "CVE-2023-20863",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In spring framework versions prior to 5.2.24 release+ ,5.3.27+ and 6.0.8+ , it is possible for a user to provide a specially crafted SpEL expression that may cause a denial-of-service (DoS) condition."
        },
        {
            "cve_id": "CVE-2022-22950",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "n Spring Framework versions 5.3.0 - 5.3.16 and older unsupported versions, it is possible for a user to provide a specially crafted SpEL expression that may cause a denial of service condition."
        },
        {
            "cve_id": "CVE-2022-22968",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In Spring Framework versions 5.3.0 - 5.3.18, 5.2.0 - 5.2.20, and older unsupported versions, the patterns for disallowedFields on a DataBinder are case sensitive which means a field is not effectively protected unless it is listed with both upper and lower case for the first character of the field, including upper and lower case for the first character of all nested fields within the property path."
        },
        {
            "cve_id": "CVE-2022-22970",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In spring framework versions prior to 5.3.20+ , 5.2.22+ and old unsupported versions, applications that handle file uploads are vulnerable to DoS attack if they rely on data binding to set a MultipartFile or javax.servlet.Part to a field in a model object."
        },
        {
            "cve_id": "CVE-2022-22971",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In spring framework versions prior to 5.3.20+ , 5.2.22+ and old unsupported versions, application with a STOMP over WebSocket endpoint is vulnerable to a denial of service attack by an authenticated user."
        },
        {
            "cve_id": "CVE-2021-22060",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In Spring Framework versions 5.3.0 - 5.3.13, 5.2.0 - 5.2.18, and older unsupported versions, it is possible for a user to provide malicious input to cause the insertion of additional log entries. This is a follow-up to CVE-2021-22096 that protects against additional types of input and in more places of the Spring Framework codebase."
        },
        {
            "cve_id": "CVE-2021-22096",
            "severity": "MEDIUM",
            "version_analyzed": "5.3.8",
            "affected_ranges_matched": "N/A",
            "description": "In Spring Framework versions 5.3.0 - 5.3.10, 5.2.0 - 5.2.17, and older unsupported versions, it is possible for a user to provide malicious input to cause the insertion of additional log entries."
        }
    ],
    "requests": [
        {
            "cve_id": "CVE-2023-32681",
            "severity": "MEDIUM",
            "version_analyzed": "2.19.1",
            "affected_ranges_matched": "N/A",
            "description": "Requests is a HTTP library. Since Requests 2.3.0, Requests has been leaking Proxy-Authorization headers to destination servers when redirected to an HTTPS endpoint. This is a product of how we use `rebuild_proxies` to reattach the `Proxy-Authorization` header to requests. For HTTP connections sent through the tunnel, the proxy will identify the header in the request itself and remove it prior to forwarding to the destination server. However when sent over HTTPS, the `Proxy-Authorization` header must be sent in the CONNECT request as the proxy has no visibility into the tunneled request. This results in Requests forwarding proxy credentials to the destination server unintentionally, allowing a malicious actor to potentially exfiltrate sensitive information. This issue has been patched in version 2.31.0."
        }
    ],
    "django": [
        {
            "cve_id": "CVE-2024-22199",
            "severity": "MEDIUM",
            "version_analyzed": "1.11.15",
            "affected_ranges_matched": "N/A",
            "description": "This package provides universal methods to use multiple template engines with the Fiber web framework using the Views interface. This vulnerability specifically impacts web applications that render user-supplied data through this template engine, potentially leading to the execution of malicious scripts in users' browsers when visiting affected web pages. The vulnerability has been addressed, the template engine now defaults to having autoescape set to `true`, effectively mitigating the risk of XSS attacks."
        },
        {
            "cve_id": "CVE-2021-33203",
            "severity": "MEDIUM",
            "version_analyzed": "1.11.15",
            "affected_ranges_matched": "N/A",
            "description": "Django before 2.2.24, 3.x before 3.1.12, and 3.2.x before 3.2.4 has a potential directory traversal via django.contrib.admindocs. Staff members could use the TemplateDetailView view to check the existence of arbitrary files. Additionally, if (and only if) the default admindocs templates have been customized by application developers to also show file contents, then not only the existence but also the file contents would have been exposed. In other words, there is directory traversal outside of the template root directories."
        }
    ]
}